import { createI18n } from 'vue-i18n'

const messages = {
  ru: {
    topbar: {
      logo: 'Твой нормальный<br />бухгалтер',
    },
    hero: {
      title: 'САЙТ АЙБЕКА',
      subtitle:
        'ТОТ, КТО СДАЕТ ЗА ТЕБЯ ВСЕ ОТЧЕТЫ И БЕРЕТ НА СЕБЯ ВЕСЬ ДОКУМЕНТООБОРОТ — БЕЗ КОСЯКОВ.',
      button: 'Записаться',
      bubble: 'Объясню все что нужно<br />вести для белой бухгалтерии',
    },
    why: {
      title: 'ЗАЧЕМ Я НУЖЕН ДЛЯ ТВОЕГО БИЗНЕСА?',
      points: [
        'Объясню все подводные камни бухгалтерии на личной встрече',
        'Срежу твои налоги в 2 РАЗА по-белому',
        'Сам буду представлять твои интересы в налоговой',
      ],
    },
    video: 'Посмотри на себя',
    videoBtn: 'ТЫКНИ НА <br />РОЛИК',
  },
  kz: {
    hero: {
      title: 'АЙБЕКТІҢ САЙТЫ',
      subtitle: 'СЕНІҢ БАРЛЫҚ ЕСЕПТЕРІҢДІ ТАПСЫРАТЫН АДАМ...',
      button: 'Жазылу',
    },
    why: {
      title: 'НЕГЕ МЕН КЕРЕК...',
      points: [
        'Барлық жасырын тастарды түсіндіремін...',
        'Салықтарыңды кемітемін...',
        'Өзім өкілдік етемін...',
      ],
    },
    video: 'Өзіңді көр',
    videoBtn: 'БЕЙНЕНІ БАС',
  },
}

export const i18n = createI18n({
  legacy: false,
  locale: localStorage.getItem('lang') || 'ru',
  messages,
})
