import { createI18n } from 'vue-i18n';
const messages = {
    ru: {
        hero: {
            title: 'САЙТ АЙБЕКА',
            subtitle: 'ТОТ, КТО СДАЕТ ЗА ТЕБЯ ВСЕ ОТЧЕТЫ...',
            button: 'Записаться',
        },
        why: {
            title: 'ЗАЧЕМ Я НУЖЕН...',
            points: [
                'Объясню все подводные камни...',
                'Срежу твои налоги...',
                'Сам буду представлять...',
            ],
        },
        video: 'Посмотри на себя',
        videoBtn: 'ТЫКНИ НА РОЛИК',
    },
    kz: {
        hero: {
            title: 'АЙБЕКТІҢ САЙТЫ',
            subtitle: 'СЕНІҢ БАРЛЫҚ ЕСЕПТЕРІҢДІ ТАПСЫРАТЫН АДАМ...',
            button: 'Жазылу',
        },
        why: {
            title: 'НЕГЕ МЕН КЕРЕК...',
            points: [
                'Барлық жасырын тастарды түсіндіремін...',
                'Салықтарыңды кемітемін...',
                'Өзім өкілдік етемін...',
            ],
        },
        video: 'Өзіңді көр',
        videoBtn: 'БЕЙНЕНІ БАС',
    },
};
export const i18n = createI18n({
    locale: 'ru',
    messages,
});
